InformationRegisters/ТелеграммСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТелеграммСообщения</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ID_Пользователя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Telegram_ВидСообщения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТелеграммКоманды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграммБоты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ID_Сообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТелеграммСлужебныеДанные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТелеграммСлужебныеДанные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграммБоты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяПараметра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ID_Пользователя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТелеграммСообщения/Ext/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	
	ЗаписатьМаксимальныНомерСообщения();
	
КонецПроцедуры


Процедура ЗаписатьМаксимальныНомерСообщения()
	
	Если ЭтотОбъект.Количество() = 0 Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	Бот 			= ЭтотОбъект[0].Бот;
	ID_Сообщения 	= ЭтотОбъект[0].ID_Сообщения;
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ТелеграммСлужебныеДанные");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	НачатьТранзакцию();
	БлокировкаДанных.Заблокировать(); 
	
	ИмяПараметра = "ID_СообщенияМаксимум";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТелеграммСлужебныеДанные.Значение КАК ID_СообщенияМаксимум
		|ИЗ
		|	РегистрСведений.ТелеграммСлужебныеДанные КАК ТелеграммСлужебныеДанные
		|ГДЕ
		|	ТелеграммСлужебныеДанные.ИмяПараметра = &ИмяПараметра
		|	И ТелеграммСлужебныеДанные.Бот = &Бот";
	
	Запрос.УстановитьПараметр("Бот", 			Бот);
	Запрос.УстановитьПараметр("ИмяПараметра", 	ИмяПараметра);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ID_СообщенияМаксимум = 0;
	
	Пока Выборка.Следующий() Цикл
		ID_СообщенияМаксимум = Выборка.ID_СообщенияМаксимум;
	КонецЦикла; 
	
	Если ID_СообщенияМаксимум < ID_Сообщения Тогда
		
		МенеджерЗаписей = РегистрыСведений.ТелеграммСлужебныеДанные.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписей.ИмяПараметра 	= ИмяПараметра;
		МенеджерЗаписей.Бот 			= Бот;
		МенеджерЗаписей.Значение 		= ID_Сообщения;
		
		МенеджерЗаписей.Записать();
		
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры
